QuickLogin/Resources/LoginAccount.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <LoginAccount xmlns="http://www.turbine.com/SE/GLS">
      <username>{0}</username>
      <password>{1}</password>
      <additionalInfo></additionalInfo>
    </LoginAccount>
  </soap12:Body>
</soap12:Envelope>